ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0g518x/TIMG7_1.0.xml
        <register id="TIMG7_TSEL" width="32" offset="0xB0" description="Trigger Select Register">
            <bitfield id="ETSEL" description="External Trigger Select. #br# This selects which System Event is used if the input filter selects trigger.  
Triggers 0-15 are used to connect triggers generated by other timer modules. Refer to the SoC datasheet for details related to timer trigger sources.
Triggers 16 and  17 are connected to event manager subscriber ports.
Event lines 18-31 are reserved for future use." begin="4" end="0" width="5" rwaccess="R/W">
                <bitenum id="TRIG0" value="0x0" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG1" value="0x1" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG2" value="0x2" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG3" value="0x3" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG4" value="0x4" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG5" value="0x5" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG6" value="0x6" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG7" value="0x7" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG8" value="0x8" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG9" value="0x9" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG10" value="0xA" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG11" value="0xB" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG12" value="0xC" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG13" value="0xD" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG14" value="0xE" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG15" value="0xF" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG_SUB0" value="0x10" description="TRIG_SUBx = External trigger input from subscriber port x."/>
                <bitenum id="TRIG_SUB1" value="0x11" description="TRIG_SUBx = External trigger input from subscriber port x."/>
            </bitfield>
            <bitfield id="TE" description="Trigger Enable.
This selects whether a trigger is enabled or not for this counter  
0x0 = Triggers are not used 
0x1 = Triggers are used as selected by the ETSEL field" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Triggers are not used."/>
                <bitenum id="ENABLED" value="0x1" description="Triggers are used as selected by the IE, ITSEL and ETSEL fields."/>
            </bitfield>
        </register>
        </group>

</module>